phynics/axoloty/Embedded/swift/sdkconfig.defaults
# Target chip
CONFIG_IDF_TARGET="esp32c6"

# Enable reproducible builds (deterministic .bin output)
CONFIG_APP_REPRODUCIBLE_BUILD=y

# Swift app tuning
CONFIG_ESP_MAIN_TASK_STACK_SIZE=12288
CONFIG_FREERTOS_HZ=1000
CONFIG_HEAP_TRACING_STANDALONE=y

# Single-app layout sized for the production Swift + Wi-Fi/MQTT image.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
